// 1. Напишіть цикл for, який виведе числа від 1 до 10 в консоль.
// for (let i = 1; i < 11; i++) {
//     alert(i);
// }
// 2. Напишіть цикл while, який виведе числа від 10 до 1 в консоль.
// let i = 10;
// while ( i ) {
//     alert( i );
//     i--;
// }
// 3. Напишіть цикл for, який виведе парні числа від 2 до 10 в консоль.
// for (let i = 2; i <= 10; i++ ) {
//     if (i % 2 == 0){
//         console.log(i)
//     }
// }
// 4. Напишіть цикл while, який виведе суму чисел від 1 до 100.
// let i = 1;
// let sum = 0;
// do {
//     sum += i
//     i++;
// } while (i < 100);
// console.log(sum);
// 5. Напишіть цикл while, який виведе всі числа, кратні 3, від 3 до 30 в консоль.
// let i = 3
// while (i <= 30) {
//     if (i % 3 === 0) {
//         console.log(i);
//     }
//     i++
// }
// 6. Напишіть цикл for, який виведе таблицю множення числа, введеного користувачем (від 1 до 10) в консоль. (Наприклад, 5 * 1 = 5, 5 * 2 = 10 і т.д.)
// for (let num = 1; num < 10; num++) {
//     console.log(num * 5);
// }

// 7. Напишіть цикл while, який знайде суму всіх чисел, кратних 5 або 7, від 1 до 1000.
// let i = 1;
// let sum = 0;

// let i = 1
// while (i <= 100) {
//     if (i % 5 === 0) {
//         sum += i
//     }
//     i++
// }
// console.log(sum);


// 8. Напишіть цикл for, який обчислить факторіал числа, яке ввів користувач.

const factorialOf = integer => {
    let factorial = 1;
  
    for(let i = 1; i <= integer; i++) {
      factorial *= i;
    }
  
    return factorial;
  }

  console.log(factorialOf(2));  // 2
console.log(factorialOf(5));  // 120
console.log(factorialOf(4));  // 24
// 9.* Напишіть цикл while, який виведе всі прості числа від 2 до 20 в консоль.
// let num = 2;
// while (num < 20) {
//     console.log(num);
//     num++
// }
// 10. Зробити всі завдання, які є на сторінці
// 1.Яке останнє значення буде виведено на екран? Чому? 
// let i = 3;
// while (i) {
//     alert(i--);
// }
// 2.Запишіть для кожного циклу значення, які він виведе. Потім порівняйте з відповіддю.

// Префіксна форма ++i

// let i = 0;
// while (++i < 5);
// alert ( i );

// Постфіксна форма i++

// let i = 0;
// while (i++ < 5);
// alert( i );
// 3.Для кожного циклу запишіть, які значення він виведе. Потім порівняйте з відповіддю.
// Постфіксна форма:
// for (let i = 0; i <5; i++) alert(i);
// Префіксна форма:
// for (let i = 0; i < 5; ++i) alert (i);
// Виведіть парні числа від 2 до 10, використовуючи цикл for
// for (let i = 2; i <=10; i++) {
//     if (i % 2 ==0 ) {
//         alert ( i );
//     }
// }
// Замініть цикл for на while так, щоб поведінка не змінилася (щоб вивід залишився той самий).
// for (let i = 0; i < 3;  i ++){
//     alert(`number ${i}!`);
// }